## Dataframe - Table

** Series either row or column **

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
a = ["ujwal","sahil","saransh","harjeet"]

In [5]:
pd.DataFrame(a)

         0
0    ujwal
1    sahil
2  saransh
3  harjeet

In [6]:
a = pd.DataFrame(a)

In [7]:
b = ["ujwal","harjeet","sahil","saransh"]

In [8]:
b = pd.DataFrame(b, index=["A B C D".split()], columns = ["Bhaichara"])

In [9]:
b

  Bhaichara
A     ujwal
B   harjeet
C     sahil
D   saransh

In [11]:
b["Bhaichara"]

A      ujwal
B    harjeet
C      sahil
D    saransh
Name: Bhaichara, dtype: object

In [12]:
type(b)

pandas.core.frame.DataFrame

In [13]:
type(b["Bhaichara"])

pandas.core.series.Series

#### Mutiple series

In [14]:
name = ["ujwal","harjeet","sahil","saransh"]
marks = [99,-69,80,100]

In [15]:
pd.DataFrame([name,marks])

       0        1      2        3
0  ujwal  harjeet  sahil  saransh
1     99      -69     80      100

In [16]:
pd.DataFrame(name,marks)

            0
 99     ujwal
-69   harjeet
 80     sahil
 100  saransh

In [33]:
row1 = ["ujwal",23,"cricketer", 65]
row2 = ["harjeet", 25, "Unemployed", 66]
row3 = ["sahil",23, "Army Man", 83]

In [34]:
a = [row1,row2,row3]

In [35]:
b = np.array([row1,row2,row3])

In [36]:
a

[['ujwal', 23, 'cricketer', 65],
 ['harjeet', 25, 'Unemployed', 66],
 ['sahil', 23, 'Army Man', 83]]

In [37]:
b

array([['ujwal', '23', 'cricketer', '65'],
       ['harjeet', '25', 'Unemployed', '66'],
       ['sahil', '23', 'Army Man', '83']], dtype='<U21')

In [38]:
pd.DataFrame(a)

         0   1           2   3
0    ujwal  23   cricketer  65
1  harjeet  25  Unemployed  66
2    sahil  23    Army Man  83

In [39]:
pd.DataFrame(b)

         0   1           2   3
0    ujwal  23   cricketer  65
1  harjeet  25  Unemployed  66
2    sahil  23    Army Man  83

In [40]:
indexes = "A B C".split()

In [41]:
columns = "name age work weight".split()

In [42]:
pd.DataFrame(a,indexes,columns)

      name  age        work  weight
A    ujwal   23   cricketer      65
B  harjeet   25  Unemployed      66
C    sahil   23    Army Man      83

In [43]:
df = pd.DataFrame(a,indexes,columns)

In [44]:
df

      name  age        work  weight
A    ujwal   23   cricketer      65
B  harjeet   25  Unemployed      66
C    sahil   23    Army Man      83

In [45]:
print(df)

      name  age        work  weight
A    ujwal   23   cricketer      65
B  harjeet   25  Unemployed      66
C    sahil   23    Army Man      83

#### Putting Data through dictionary

In [46]:
d = {
    1:["ujwal",20,'netmax',65],
    2:["harjeet",21,'netmax',63],
    3:["sahil",22,'netmax',69]
}

In [49]:
pd.DataFrame(d)

        1        2       3
0   ujwal  harjeet   sahil
1      20       21      22
2  netmax   netmax  netmax
3      65       63      69

In [50]:
pd.DataFrame(d).T

         0   1       2   3
1    ujwal  20  netmax  65
2  harjeet  21  netmax  63
3    sahil  22  netmax  69

In [51]:
d = {
    "name": ["ujwal","sahil","harjeet"],
    "age": [21,23,22],
    "weight":[62,70,56]
}

In [52]:
d

{'name': ['ujwal', 'sahil', 'harjeet'],
 'age': [21, 23, 22],
 'weight': [62, 70, 56]}

In [53]:
pd.DataFrame(d)

      name  age  weight
0    ujwal   21      62
1    sahil   23      70
2  harjeet   22      56

In [54]:
pd.DataFrame(d, index=range(100,103))

        name  age  weight
100    ujwal   21      62
101    sahil   23      70
102  harjeet   22      56

In [55]:
d = pd.DataFrame(d, index=range(100,103))

In [56]:
d

        name  age  weight
100    ujwal   21      62
101    sahil   23      70
102  harjeet   22      56